<?$str = '{{Сегодня {утром|после обеда}}|Вчера} я {побежал|пошел|поехал{ на автобусе| на машине| на {трамвае|троллейбусе}|}} в {зоо|компьютерный|интимный|продуктовый} магазин чтобы {купить|украсть} {костюм {совы|{человека паука|бетмена}|винни-пуха|колобка}|презерватив}';
while(preg_match('#(?<!\\\)\{#', $str))
{
    $str = preg_replace_callback('#(?<!\\\)\{((?(?!\\\)[^\{]+?|[\s\S]+?))(?<!\\\)\}#', function($mathces)
    {
        $arr = preg_split('#(?<!\\\)\|#', $mathces[1]);
        return $arr[array_rand($arr)];
    }, $str);
}
$str = str_replace(array('\{', '\}', '\|'), array('{', '}', '|'), $str);
echo $str;